controllers/SiteController.php

    public function actionIndex()
    {
        // Get our results
        $arComments = Comments::find()
            ->orderBy( 'date_created desc' )
            ->all();
---
SELECT * FROM `comments` ORDER BY `date_created` DESC

    public function actionLoadcontent( $id )
    {
        // Get our results, based on direction
        if( $id == 1 ) {
            $arComments = Comments::find()
                ->orderBy( 'date_created desc' )
                ->all();
        }
        else {
            $arComments = Comments::find()
                ->orderBy( 'date_created asc' )
                ->all();
---
SELECT * FROM `comments` ORDER BY `date_created` DESC
SELECT * FROM `comments` ORDER BY `date_created`

    public function actionSavecontent()
    {
        // Crete our new model
        $model = new CommentForm();

        // We should be receiving ajax only for this action
        if( Yii::$app->request->isAjax && $model->load( Yii::$app->request->post() ) ) {

            // Add the date...
            $model->date_created = date( 'Y-m-d H:i:s' );;

            // Validate again...
            if( $model->validate() ) {
                // It's valid!
                $model->save();
---
INSERT INTO `comments` (`name`, `email`, `comments`, `date_created`) VALUES ('Ryp Walters', 'ryp@overcoffee.com', 'Wow!  Super comment wall.', '2015-05-28 14:56:26')